/*********************************************************************************************
* 文件：time.c
* 作者：
* 说明： 
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "time.h"
#include "led.h"
#include "sensor_el.h"
#include "relay.h"
#include "oled_el.h"

/*********************************************************************************************
* 名称：time1Int_init
* 功能：定时器1中断初始化
* 参数：
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void time1Int_init(void)
{
    u16 t1Arr = 50000;
    
    T1CTL |= (1<<1);                                            //模计数，0--T1CC0
    T1CTL |= (1<<3);                                            //32分频
    
    T1CC0L = t1Arr&0xff;
    T1CC0H = (t1Arr>>8)&0xff;
    T1CCTL0 |= (1<<2);                                          //定时器设为比较模式

    //设置中断优先级最低
    IP0 &= ~(1<<1);
    IP1 &= ~(1<<1);
    
    IEN1 |= 0X02;                                               //定时器1中断使能
    EA=1;                                                       //开总中断 
}

#define INT_TIME 5

//刷卡标志
u8 idFlag=1;

//开继电器时间控制
u16 relay_tiem=0;

/*********************************************************************************************
* 名称：T1_ISR
* 功能：定时器1中断服务程序
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
#pragma vector = T1_VECTOR      
__interrupt void T1_ISR(void)            
{  
  static u8 t1_count=1;
  static u8 clear_delay=0;
  u8 temp_buf[5]={0};

  if(t1_count>INT_TIME)
  {
    if(!mcuRead_idCard(0x00,temp_buf))
    {
      /*没有检测到卡*/
      idFlag = 0;
      /*清除卡号和状态显示*/
      if(clear_delay>=INT_TIME) {
        oled_areaClear(36,95,2,3);
        clear_delay=0;
      }
    }
    else if(idFlag==0)
    {
      /*检测到卡*/
      clear_delay=0;
      idFlag = 1;                                               // 卡片信息已读取，避免重复读卡
      rfid_unlock_app();                                        // 调用ic_card门禁处理函数
    }
    t1_count = 1;
    clear_delay++;
  }
  t1_count++;

  T1IF=0;  
}